Prior to any state modifications, current plan from mgmt/base_config is consistent with "Plan of Attack" commentary above:

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_kms_alias.primary_config_sdlc["prod"] will be created
  + resource "aws_kms_alias" "primary_config_sdlc" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/bfd-prod-config-cmk"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_alias.primary_config_sdlc["prod-sbx"] will be created
  + resource "aws_kms_alias" "primary_config_sdlc" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/bfd-prod-sbx-config-cmk"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_alias.primary_config_sdlc["test"] will be created
  + resource "aws_kms_alias" "primary_config_sdlc" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/bfd-test-config-cmk"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_alias.secondary_config_sdlc["prod"] will be created
  + resource "aws_kms_alias" "secondary_config_sdlc" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/bfd-prod-config-cmk"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_alias.secondary_config_sdlc["prod-sbx"] will be created
  + resource "aws_kms_alias" "secondary_config_sdlc" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/bfd-prod-sbx-config-cmk"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_alias.secondary_config_sdlc["test"] will be created
  + resource "aws_kms_alias" "secondary_config_sdlc" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/bfd-test-config-cmk"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.primary_config_sdlc["prod"] will be created
  + resource "aws_kms_key" "primary_config_sdlc" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "prod primary config; used for sensitive SSM configuration"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = true
      + policy                             = jsonencode(
            {
              + Id        = "config-key-policy"
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::577373831711:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + rotation_period_in_days            = (known after apply)
      + tags_all                           = {
          + "Environment"    = "mgmt"
          + "Terraform"      = "true"
          + "application"    = "bfd"
          + "business"       = "oeda"
          + "stack"          = "mgmt"
          + "tf_module_root" = "ops/terraform/env/mgmt/base_config"
        }
    }

  # aws_kms_key.primary_config_sdlc["prod-sbx"] will be created
  + resource "aws_kms_key" "primary_config_sdlc" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "prod-sbx primary config; used for sensitive SSM configuration"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = true
      + policy                             = jsonencode(
            {
              + Id        = "config-key-policy"
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::577373831711:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + rotation_period_in_days            = (known after apply)
      + tags_all                           = {
          + "Environment"    = "mgmt"
          + "Terraform"      = "true"
          + "application"    = "bfd"
          + "business"       = "oeda"
          + "stack"          = "mgmt"
          + "tf_module_root" = "ops/terraform/env/mgmt/base_config"
        }
    }

  # aws_kms_key.primary_config_sdlc["test"] will be created
  + resource "aws_kms_key" "primary_config_sdlc" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "test primary config; used for sensitive SSM configuration"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = true
      + policy                             = jsonencode(
            {
              + Id        = "config-key-policy"
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::577373831711:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + rotation_period_in_days            = (known after apply)
      + tags_all                           = {
          + "Environment"    = "mgmt"
          + "Terraform"      = "true"
          + "application"    = "bfd"
          + "business"       = "oeda"
          + "stack"          = "mgmt"
          + "tf_module_root" = "ops/terraform/env/mgmt/base_config"
        }
    }

  # aws_kms_replica_key.secondary_config_sdlc["prod"] will be created
  + resource "aws_kms_replica_key" "secondary_config_sdlc" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + deletion_window_in_days            = 30
      + description                        = "prod replica config; used for sensitive SSM configuration"
      + enabled                            = true
      + id                                 = (known after apply)
      + key_id                             = (known after apply)
      + key_rotation_enabled               = (known after apply)
      + key_spec                           = (known after apply)
      + key_usage                          = (known after apply)
      + policy                             = jsonencode(
            {
              + Id        = "config-key-policy"
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::577373831711:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + primary_key_arn                    = (known after apply)
      + tags_all                           = {
          + "Environment"    = "mgmt"
          + "Terraform"      = "true"
          + "application"    = "bfd"
          + "business"       = "oeda"
          + "stack"          = "mgmt"
          + "tf_module_root" = "ops/terraform/env/mgmt/base_config"
        }
    }

  # aws_kms_replica_key.secondary_config_sdlc["prod-sbx"] will be created
  + resource "aws_kms_replica_key" "secondary_config_sdlc" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + deletion_window_in_days            = 30
      + description                        = "prod-sbx replica config; used for sensitive SSM configuration"
      + enabled                            = true
      + id                                 = (known after apply)
      + key_id                             = (known after apply)
      + key_rotation_enabled               = (known after apply)
      + key_spec                           = (known after apply)
      + key_usage                          = (known after apply)
      + policy                             = jsonencode(
            {
              + Id        = "config-key-policy"
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::577373831711:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + primary_key_arn                    = (known after apply)
      + tags_all                           = {
          + "Environment"    = "mgmt"
          + "Terraform"      = "true"
          + "application"    = "bfd"
          + "business"       = "oeda"
          + "stack"          = "mgmt"
          + "tf_module_root" = "ops/terraform/env/mgmt/base_config"
        }
    }

  # aws_kms_replica_key.secondary_config_sdlc["test"] will be created
  + resource "aws_kms_replica_key" "secondary_config_sdlc" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + deletion_window_in_days            = 30
      + description                        = "test replica config; used for sensitive SSM configuration"
      + enabled                            = true
      + id                                 = (known after apply)
      + key_id                             = (known after apply)
      + key_rotation_enabled               = (known after apply)
      + key_spec                           = (known after apply)
      + key_usage                          = (known after apply)
      + policy                             = jsonencode(
            {
              + Id        = "config-key-policy"
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::577373831711:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + primary_key_arn                    = (known after apply)
      + tags_all                           = {
          + "Environment"    = "mgmt"
          + "Terraform"      = "true"
          + "application"    = "bfd"
          + "business"       = "oeda"
          + "stack"          = "mgmt"
          + "tf_module_root" = "ops/terraform/env/mgmt/base_config"
        }
    }

Plan: 12 to add, 0 to change, 0 to destroy.
```